In [1]:
#import Pandas
import pandas as pd

In [2]:
#read salaries.csv into sal
sal = pd.read_csv('Salaries.csv')
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [3]:
#find average 'BasePay'
sal['BasePay'].mean()

66325.44884050643

In [4]:
#find highest amount of 'OvertimePay'
sal['OvertimePay'].max()

245131.88

In [5]:
#find the job title of  JOSEPH DRISCOLL
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [6]:
#find TotalPay of  JOSEPH DRISCOLL including Benefits
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL'][['TotalPay'] + ['Benefits']]

     TotalPay  Benefits
24  270324.91       NaN

In [14]:
#find the name of highest paid person including benefits
sal[sal['TotalPay'] + sal['Benefits'].fillna(0) == (sal['TotalPay'] + sal['Benefits'].fillna(0)).max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [16]:
#find the name of lowest paid person including benefits
sal[sal['TotalPay'] + sal['Benefits'].fillna(0) == (sal['TotalPay'] + sal['Benefits'].fillna(0)).min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [29]:
#find the average BasePay of all employees per year (2011-2014) 
sal[['BasePay','Year']].groupby('Year').mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

In [31]:
#find unique number job titles
sal['JobTitle'].nunique()

2159

In [34]:
#find the top 5 most common jobs
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [43]:
#find Job Titles with only one occurence in 2013
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [65]:
#find number of people with the word Chief in their job title
sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower().split()))

477